src/erlang/tutorial/concurrency/example.org
#+TITLE: 完整实例
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_UP: distribution.html   
#+HTML_LINK_HOME: concurrency.html
#+OPTIONS: num:nil timestamp:nil ^:nil

接下来这个示例是一个简单的消息传递者（messager）示例。Messager 是一个允许用登录到不同的结点并向彼此发送消息的应用程序

#+begin_example
  开始之前，请注意以下几点：

  1. 这个示例只演示了消息传递的逻辑，没有提供用户友好的界面（虽然这在 Erlang 是可以做到的）
  2. 这类的问题使用 OTP 的工具可以非常方便的实现，还能同时提供线上更新的方法等
  3. 这个示例程序并不完整，它没有考虑到结点离开等情况。这个问题在后面的版本会得到修复
#+end_example

Messager 允许 “客户端” 连接到集中的服务器并表明其身份。也就是说，用户并不需要知道另外一个用户所在 Erlang 结点的名称就可以发送消息
#+begin_src erlang 
    -module(messenger).
    -export([start_server/0, server/1, logon/1, logoff/0, message/2, client/2]).

    %%% Change the function below to return the name of the node where the
    %%% messenger server runs
    server_node() ->
	messenger@bill.

    %%% This is the server process for the "messenger"
    %%% the user list has the format [{ClientPid1, Name1},{ClientPid22, Name2},...]
    server(User_List) ->
	receive
	    {From, logon, Name} ->
		New_User_List = server_logon(From, Name, User_List),
		server(New_User_List);
	    {From, logoff} ->
		New_User_List = server_logoff(From, User_List),
		server(New_User_List);
	    {From, message_to, To, Message} ->
		server_transfer(From, To, Message, User_List),
		io:format("list is now: ~p~n", [User_List]),
		server(User_List)
	end.

    %%% Start the server
    start_server() ->
	register(messenger, spawn(messenger, server, [[]])).

    %%% Server adds a new user to the user list
    server_logon(From, Name, User_List) ->
	%% check if logged on anywhere else
	case lists:keymember(Name, 2, User_List) of
	    true ->
		From ! {messenger, stop, user_exists_at_other_node},  %reject logon
		User_List;
	    false ->
		From ! {messenger, logged_on},
		[{From, Name} | User_List]        %add user to the list
	end.

    %%% Server deletes a user from the user list
    server_logoff(From, User_List) ->
	lists:keydelete(From, 1, User_List).

    %%% Server transfers a message between user
    server_transfer(From, To, Message, User_List) ->
	%% check that the user is logged on and who he is
	case lists:keysearch(From, 1, User_List) of
	    false ->
		From ! {messenger, stop, you_are_not_logged_on};
	    {value, {From, Name}} ->
		server_transfer(From, Name, To, Message, User_List)
	end.
    %%% If the user exists, send the message
    server_transfer(From, Name, To, Message, User_List) ->
	%% Find the receiver and send the message
	case lists:keysearch(To, 2, User_List) of
	    false ->
		From ! {messenger, receiver_not_found};
	    {value, {ToPid, To}} ->
		ToPid ! {message_from, Name, Message}, 
		From ! {messenger, sent} 
	end.

    %%% User Commands
    logon(Name) ->
	case whereis(mess_client) of 
	    undefined ->
		register(mess_client, 
			 spawn(messenger, client, [server_node(), Name]));
	    _ -> already_logged_on
	end.

    logoff() ->
	mess_client ! logoff.

    message(ToName, Message) ->
	case whereis(mess_client) of % Test if the client is running
	    undefined ->
		not_logged_on;
	    _ -> mess_client ! {message_to, ToName, Message},
		 ok
	end.

    %%% The client process which runs on each server node
    client(Server_Node, Name) ->
	{messenger, Server_Node} ! {self(), logon, Name},
	await_result(),
	client(Server_Node).

    client(Server_Node) ->
	receive
	    logoff ->
		{messenger, Server_Node} ! {self(), logoff},
		exit(normal);
	    {message_to, ToName, Message} ->
		{messenger, Server_Node} ! {self(), message_to, ToName, Message},
		await_result();
	    {message_from, FromName, Message} ->
		io:format("Message from ~p: ~p~n", [FromName, Message])
	end,
	client(Server_Node).

    %%% wait for a response from the server
    await_result() ->
	receive
	    {messenger, stop, Why} -> % Stop the client 
		io:format("~p~n", [Why]),
		exit(normal);
	    {messenger, What} ->  % Normal response
		io:format("~p~n", [What])
	end.
#+end_src

#+begin_example
  先来看看这个例子引入的一些新的概念
#+end_example

