html/erlang/tutorial/concurrency/example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>完整实例</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="distribution.html"> UP </a>
 |
 <a accesskey="H" href="concurrency.html"> HOME </a>
</div><div id="content">
<h1 class="title">完整实例</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org709fe8c">尾递归</a></li>
<li><a href="#org7ea6fa2">list 模块</a></li>
<li><a href="#orga40a774">退出进程</a></li>
<li><a href="#org9104722">测试</a></li>
<li><a href="#orgfe99a6a">详细分析</a></li>
</ul>
</div>
</div>
<p>
接下来这个示例是一个简单的消息传递者（messager）示例。Messager 是一个允许用登录到不同的结点并向彼此发送消息的应用程序
</p>

<pre class="example">
开始之前，请注意以下几点：

1. 这个示例只演示了消息传递的逻辑，没有提供用户友好的界面（虽然这在 Erlang 是可以做到的）
2. 这类的问题使用 OTP 的工具可以非常方便的实现，还能同时提供线上更新的方法等
3. 这个示例程序并不完整，它没有考虑到结点离开等情况。这个问题在后面的版本会得到修复
</pre>

<p>
Messager 允许 “客户端” 连接到集中的服务器并表明其身份。也就是说，用户并不需要知道另外一个用户所在 Erlang 结点的名称就可以发送消息
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(messenger).
<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">start_server/0</span>, <span style="color: #98f5ff;">server/1</span>, <span style="color: #98f5ff;">logon/1</span>, <span style="color: #98f5ff;">logoff/0</span>, <span style="color: #98f5ff;">message/2</span>, <span style="color: #98f5ff;">client/2</span>]).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Change the function below to return the name of the node where the</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">messenger server runs</span>
<span style="color: #daa520; font-weight: bold;">server_node</span>() -&gt;
    messenger@bill.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">This is the server process for the "messenger"</span>
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">the user list has the format [{ClientPid1, Name1},{ClientPid22, Name2},...]</span>
<span style="color: #daa520; font-weight: bold;">server</span>(<span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        {<span style="color: #4eee94;">From</span>, logon, <span style="color: #4eee94;">Name</span>} -&gt;
            <span style="color: #4eee94;">New_User_List</span> = <span style="color: #98f5ff;">server_logon</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">New_User_List</span>);
        {<span style="color: #4eee94;">From</span>, logoff} -&gt;
            <span style="color: #4eee94;">New_User_List</span> = <span style="color: #98f5ff;">server_logoff</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">New_User_List</span>);
        {<span style="color: #4eee94;">From</span>, message_to, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>} -&gt;
            <span style="color: #98f5ff;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>),
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"list is now: ~p~n"</span>, [<span style="color: #4eee94;">User_List</span>]),
            <span style="color: #98f5ff;">server</span>(<span style="color: #4eee94;">User_List</span>)
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Start the server</span>
<span style="color: #daa520; font-weight: bold;">start_server</span>() -&gt;
    <span style="color: #f08080;">register</span>(messenger, <span style="color: #f08080;">spawn</span>(messenger, server, [[]])).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server adds a new user to the user list</span>
<span style="color: #daa520; font-weight: bold;">server_logon</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">check if logged on anywhere else</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keymember</span>(<span style="color: #4eee94;">Name</span>, 2, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        true -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, stop, user_exists_at_other_node},  <span style="color: #5f9ea0; font-style: italic;">%</span><span style="color: #5f9ea0; font-style: italic;">reject logon</span>
            <span style="color: #4eee94;">User_List</span>;
        false -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, logged_on},
            [{<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>} | <span style="color: #4eee94;">User_List</span>]        <span style="color: #5f9ea0; font-style: italic;">%</span><span style="color: #5f9ea0; font-style: italic;">add user to the list</span>
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server deletes a user from the user list</span>
<span style="color: #daa520; font-weight: bold;">server_logoff</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keydelete</span>(<span style="color: #4eee94;">From</span>, 1, <span style="color: #4eee94;">User_List</span>).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server transfers a message between user</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">check that the user is logged on and who he is</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">From</span>, 1, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, stop, you_are_not_logged_on};
        {value, {<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>}} -&gt;
            <span style="color: #98f5ff;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>)
    <span style="color: #00bfff; font-weight: bold;">end</span>.
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">If the user exists, send the message</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">Find the receiver and send the message</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">To</span>, 2, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, receiver_not_found};
        {value, {<span style="color: #4eee94;">ToPid</span>, <span style="color: #4eee94;">To</span>}} -&gt;
            <span style="color: #4eee94;">ToPid</span> ! {message_from, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">Message</span>}, 
            <span style="color: #4eee94;">From</span> ! {messenger, sent} 
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">User Commands</span>
<span style="color: #daa520; font-weight: bold;">logon</span>(<span style="color: #4eee94;">Name</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> 
        undefined -&gt;
            <span style="color: #f08080;">register</span>(mess_client, 
                     <span style="color: #f08080;">spawn</span>(messenger, client, [<span style="color: #98f5ff;">server_node</span>(), <span style="color: #4eee94;">Name</span>]));
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>already_logged_on
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #daa520; font-weight: bold;">logoff</span>() -&gt;
    mess_client ! logoff.

<span style="color: #daa520; font-weight: bold;">message</span>(<span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Test if the client is running</span>
        undefined -&gt;
            not_logged_on;
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>mess_client ! {message_to, <span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>},
             ok
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">The client process which runs on each server node</span>
<span style="color: #daa520; font-weight: bold;">client</span>(<span style="color: #4eee94;">Server_Node</span>, <span style="color: #4eee94;">Name</span>) -&gt;
    {messenger, <span style="color: #4eee94;">Server_Node</span>} ! {<span style="color: #f08080;">self</span>(), logon, <span style="color: #4eee94;">Name</span>},
    <span style="color: #98f5ff;">await_result</span>(),
    <span style="color: #98f5ff;">client</span>(<span style="color: #4eee94;">Server_Node</span>).

<span style="color: #daa520; font-weight: bold;">client</span>(<span style="color: #4eee94;">Server_Node</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        logoff -&gt;
            {messenger, <span style="color: #4eee94;">Server_Node</span>} ! {<span style="color: #f08080;">self</span>(), logoff},
            <span style="color: #f08080;">exit</span>(normal);
        {message_to, <span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>} -&gt;
            {messenger, <span style="color: #4eee94;">Server_Node</span>} ! {<span style="color: #f08080;">self</span>(), message_to, <span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>},
            <span style="color: #98f5ff;">await_result</span>();
        {message_from, <span style="color: #4eee94;">FromName</span>, <span style="color: #4eee94;">Message</span>} -&gt;
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"Message from ~p: ~p~n"</span>, [<span style="color: #4eee94;">FromName</span>, <span style="color: #4eee94;">Message</span>])
    <span style="color: #00bfff; font-weight: bold;">end</span>,
    <span style="color: #98f5ff;">client</span>(<span style="color: #4eee94;">Server_Node</span>).

<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">wait for a response from the server</span>
<span style="color: #daa520; font-weight: bold;">await_result</span>() -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        {messenger, stop, <span style="color: #4eee94;">Why</span>} -&gt;<span style="color: #daa520; font-weight: bold;"> </span><span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Stop the client </span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">Why</span>]),
            <span style="color: #f08080;">exit</span>(normal);
        {messenger, <span style="color: #4eee94;">What</span>} -&gt;<span style="color: #daa520; font-weight: bold;"> </span> <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Normal response</span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">What</span>])
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<pre class="example">
先来看看这个例子引入的一些新的概念
</pre>
