src/erlang/tutorial/concurrency/example.org
* 尾递归
  这里有两个版本的 server_transfer 函数：其中一个有四个参数（server_transfer/4）另外一个有五个参数（server_transfer/5）

  #+begin_src erlang 
      %%% Server transfers a message between user
      server_transfer(From, To, Message, User_List) ->
	  %% check that the user is logged on and who he is
	  case lists:keysearch(From, 1, User_List) of
	      false ->
		  From ! {messenger, stop, you_are_not_logged_on};
	      {value, {From, Name}} ->
		  server_transfer(From, Name, To, Message, User_List)
	  end.
      %%% If the user exists, send the message
      server_transfer(From, Name, To, Message, User_List) ->
	  %% Find the receiver and send the message
	  case lists:keysearch(To, 2, User_List) of
	      false ->
		  From ! {messenger, receiver_not_found};
	      {value, {ToPid, To}} ->
		  ToPid ! {message_from, Name, Message}, 
		  From ! {messenger, sent} 
	  end.
  #+end_src

  #+begin_example
    请注意：如何让 server_transfer 函数通过 server(User_List) 调用其自身的，这里形成了一个循环

    Erlang 编译器非常的聪明，它会将上面的代码优化为一个循环而不是一个非法的递规函数调用

    但是它只能是在函数调用后面没有别的代码的情况下才能工作（即尾递规）
  #+end_example

* list 模块
  上面的函数里用到了 _lists 模块中_ 的函数 _lists:keymemeber(Key,Position,Lists)_  函数遍历列表中的元组：
  + 查看每个元组的指定位置 （Position）处的数据并判断元组该位置是否与 Key 相等
    + 元组中的第一个元素的位置为 1，依次类推
  + 如果发现某个元组的 Position 位置处的元素与 Key 相同，则返回 true，否则返回 false

    #+begin_src sh 
    3> lists:keymember(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}]).
    true

    4> lists:keymember(p, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}]).
    false
    #+end_src

    _lists:keydelete_ 与 lists:keymember 非常相似，只不过它将删除列表中找到的第一个元组（如果存在），并返回剩余的列表：
    #+begin_src sh 
  3>  lists:keydelete(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}]). 
  [{x,y,z},{b,b,b},{q,r,s}]
    #+end_src

    _lists:keysearch_ 与 lists:keymember 类似，但是它将返回 {value,Tuple_Found} 或者原子值 false。

    #+begin_src sh 
    4>  lists:keysearch(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}]). 
    {value,{b,a,c}}

    5>  lists:keysearch(p, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}]). 
    false
    #+end_src

    #+begin_example
      lists 模块是一个非常有用的模块，推荐通过用户手册仔细研究一下 erl -man lists 
    #+end_example

* 退出进程
  Erlang 进程（概念上地）会一直运行直到它执行 receive 命令，而此时消息队列中又没有它想接收的消息为止
  #+begin_example
  “概念上地” 是因为 Erlang 系统活跃的进程实际上是共享 CPU 处理时间的
  #+end_example

  当进程无事可做时，即一个函数调用 _return_ 返回而没有调用另外一个函数时，进程就结束，另外一种终止进程的方式是调用 _exit/1_ 函数

  #+begin_src erlang 
  await_result() ->
      receive
	  {messenger, stop, Why} -> % Stop the client 
	      io:format("~p~n", [Why]),
	      exit(normal);
	  {messenger, What} ->  % Normal response
	      io:format("~p~n", [What])
      end.
  #+end_src

  #+begin_example
    exit/1 函数的参数是有特殊含义的，实际上是进程结束的状态值

    在这个例子中使用 exit(normal) 结束进程，它与程序因没有再调用函数而终止的效果是一样的
  #+end_example

  内置函数 _whereis(RegisteredName)_ 用于检查是否已有一个进程注册了进程名称 RegisteredName：
  + 如果已经存在，则返回进程的 _进程标识符_ 
  + 如果不存在，则返回原子值 _undefined_ 

  #+begin_src erlang 
  logon(Name) ->
      case whereis(mess_client) of 
	  undefined ->
	      register(mess_client, 
		       spawn(messenger, client, [server_node(), Name]));
	  _ -> already_logged_on
      end.

  logoff() ->
      mess_client ! logoff.

  message(ToName, Message) ->
      case whereis(mess_client) of % Test if the client is running
	  undefined ->
	      not_logged_on;
	  _ -> mess_client ! {message_to, ToName, Message},
	       ok
  end.
  #+end_src

  #+begin_example
    到这儿，应该已经可以看懂 messager 模块的大部分代码了
  #+end_example

