html/erlang/tutorial/concurrency/example.html

<div id="outline-container-org709fe8c" class="outline-2">
<h2 id="org709fe8c">尾递归</h2>
<div class="outline-text-2" id="text-org709fe8c">
<p>
这里有两个版本的 server_transfer 函数：其中一个有四个参数（server_transfer/4）另外一个有五个参数（server_transfer/5）
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">Server transfers a message between user</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">check that the user is logged on and who he is</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">From</span>, 1, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, stop, you_are_not_logged_on};
        {value, {<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>}} -&gt;
            <span style="color: #98f5ff;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>)
    <span style="color: #00bfff; font-weight: bold;">end</span>.
<span style="color: #5f9ea0; font-style: italic;">%%% </span><span style="color: #5f9ea0; font-style: italic;">If the user exists, send the message</span>
<span style="color: #daa520; font-weight: bold;">server_transfer</span>(<span style="color: #4eee94;">From</span>, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">To</span>, <span style="color: #4eee94;">Message</span>, <span style="color: #4eee94;">User_List</span>) -&gt;
    <span style="color: #5f9ea0; font-style: italic;">%% </span><span style="color: #5f9ea0; font-style: italic;">Find the receiver and send the message</span>
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #98f5ff;">lists</span>:<span style="color: #98f5ff;">keysearch</span>(<span style="color: #4eee94;">To</span>, 2, <span style="color: #4eee94;">User_List</span>) <span style="color: #00bfff; font-weight: bold;">of</span>
        false -&gt;
            <span style="color: #4eee94;">From</span> ! {messenger, receiver_not_found};
        {value, {<span style="color: #4eee94;">ToPid</span>, <span style="color: #4eee94;">To</span>}} -&gt;
            <span style="color: #4eee94;">ToPid</span> ! {message_from, <span style="color: #4eee94;">Name</span>, <span style="color: #4eee94;">Message</span>}, 
            <span style="color: #4eee94;">From</span> ! {messenger, sent} 
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<pre class="example">
请注意：如何让 server_transfer 函数通过 server(User_List) 调用其自身的，这里形成了一个循环

Erlang 编译器非常的聪明，它会将上面的代码优化为一个循环而不是一个非法的递规函数调用

但是它只能是在函数调用后面没有别的代码的情况下才能工作（即尾递规）
</pre>
</div>
</div>

<div id="outline-container-org7ea6fa2" class="outline-2">
<h2 id="org7ea6fa2">list 模块</h2>
<div class="outline-text-2" id="text-org7ea6fa2">
<p>
上面的函数里用到了 <span class="underline">lists 模块中</span> 的函数 <span class="underline">lists:keymemeber(Key,Position,Lists)</span>  函数遍历列表中的元组：
</p>
<ul class="org-ul">
<li>查看每个元组的指定位置 （Position）处的数据并判断元组该位置是否与 Key 相等
<ul class="org-ul">
<li>元组中的第一个元素的位置为 1，依次类推</li>
</ul></li>
<li><p>
如果发现某个元组的 Position 位置处的元素与 Key 相同，则返回 true，否则返回 false
</p>

<div class="org-src-container">
<pre class="src src-sh">3&gt; lists:keymember(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}])<span style="color: #f08080;">.</span>
true

4&gt; lists:keymember(p, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}])<span style="color: #f08080;">.</span>
false
</pre>
</div>

<p>
<span class="underline">lists:keydelete</span> 与 lists:keymember 非常相似，只不过它将删除列表中找到的第一个元组（如果存在），并返回剩余的列表：
</p>
<div class="org-src-container">
<pre class="src src-sh">3&gt;  lists:keydelete(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}])<span style="color: #f08080;">.</span> 
[{x,y,z},{b,b,b},{q,r,s}]
</pre>
</div>

<p>
<span class="underline">lists:keysearch</span> 与 lists:keymember 类似，但是它将返回 {value,Tuple_Found} 或者原子值 false。
</p>

<div class="org-src-container">
<pre class="src src-sh">4&gt;  lists:keysearch(a, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}])<span style="color: #f08080;">.</span> 
{value,{b,a,c}}

5&gt;  lists:keysearch(p, 2, [{x,y,z},{b,b,b},{b,a,c},{q,r,s}])<span style="color: #f08080;">.</span> 
false
</pre>
</div>

<pre class="example">
lists 模块是一个非常有用的模块，推荐通过用户手册仔细研究一下 erl -man lists 
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orga40a774" class="outline-2">
<h2 id="orga40a774">退出进程</h2>
<div class="outline-text-2" id="text-orga40a774">
<p>
Erlang 进程（概念上地）会一直运行直到它执行 receive 命令，而此时消息队列中又没有它想接收的消息为止
</p>
<pre class="example">
“概念上地” 是因为 Erlang 系统活跃的进程实际上是共享 CPU 处理时间的
</pre>

<p>
当进程无事可做时，即一个函数调用 <span class="underline">return</span> 返回而没有调用另外一个函数时，进程就结束，另外一种终止进程的方式是调用 <span class="underline">exit/1</span> 函数
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">await_result</span>() -&gt;
    <span style="color: #00bfff; font-weight: bold;">receive</span>
        {messenger, stop, <span style="color: #4eee94;">Why</span>} -&gt;<span style="color: #daa520; font-weight: bold;"> </span><span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Stop the client </span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">Why</span>]),
            <span style="color: #f08080;">exit</span>(normal);
        {messenger, <span style="color: #4eee94;">What</span>} -&gt;<span style="color: #daa520; font-weight: bold;"> </span> <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Normal response</span>
            <span style="color: #98f5ff;">io</span>:<span style="color: #98f5ff;">format</span>(<span style="color: #deb887;">"~p~n"</span>, [<span style="color: #4eee94;">What</span>])
    <span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<pre class="example">
exit/1 函数的参数是有特殊含义的，实际上是进程结束的状态值

在这个例子中使用 exit(normal) 结束进程，它与程序因没有再调用函数而终止的效果是一样的
</pre>

<p>
内置函数 <span class="underline">whereis(RegisteredName)</span> 用于检查是否已有一个进程注册了进程名称 RegisteredName：
</p>
<ul class="org-ul">
<li>如果已经存在，则返回进程的 <span class="underline">进程标识符</span></li>
<li>如果不存在，则返回原子值 <span class="underline">undefined</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">logon</span>(<span style="color: #4eee94;">Name</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> 
        undefined -&gt;
            <span style="color: #f08080;">register</span>(mess_client, 
                     <span style="color: #f08080;">spawn</span>(messenger, client, [<span style="color: #98f5ff;">server_node</span>(), <span style="color: #4eee94;">Name</span>]));
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>already_logged_on
    <span style="color: #00bfff; font-weight: bold;">end</span>.

<span style="color: #daa520; font-weight: bold;">logoff</span>() -&gt;
    mess_client ! logoff.

<span style="color: #daa520; font-weight: bold;">message</span>(<span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>) -&gt;
    <span style="color: #00bfff; font-weight: bold;">case</span> <span style="color: #f08080;">whereis</span>(mess_client) <span style="color: #00bfff; font-weight: bold;">of</span> <span style="color: #5f9ea0; font-style: italic;">% </span><span style="color: #5f9ea0; font-style: italic;">Test if the client is running</span>
        undefined -&gt;
            not_logged_on;
        <span style="color: #4eee94;">_</span> -&gt;<span style="color: #daa520; font-weight: bold;"> </span>mess_client ! {message_to, <span style="color: #4eee94;">ToName</span>, <span style="color: #4eee94;">Message</span>},
             ok
<span style="color: #00bfff; font-weight: bold;">end</span>.
</pre>
</div>

<pre class="example">
到这儿，应该已经可以看懂 messager 模块的大部分代码了
</pre>
</div>
</div>
